/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: ลดการใช้โค้ดซ้ำ อ่านง่ายขึ้น


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer: ถ้าใช้แบบพอดี จะอ่านง่าย ถ้าใช้เยอะๆ ก็อาจจะอ่านยาก มันจะทำให้ดูงง


3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  
Callback เป็นฟังก์ชั่นที่จะถูกฟังก์ชั่นอื่นเรียกใช้
Higher-order เป็นฟังก์ชั่นที่รับพารามิเตอร์มา และคืนค่าเป็น callback ฟังก์ชั่น

*/